app/views/movies/show.html.erb

SELECT "reeviews".* FROM "reeviews" WHERE "reeviews"."movie_id" = ?  [["movie_id", 1]]
---

    <% if @movie.reeviews.blank? %>