app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%%')
---
  def index
    @movies = Movie.where(["title LIKE ?","%#{params[:search]}%"])

SELECT "reeviews".* FROM "reeviews" WHERE "reeviews"."movie_id" = ?  [["movie_id", 1]]
---
  def show
    @reviews = @movie.reeviews
    @reviewed_users = @reviews.collect(&:user_id)