app/controllers/reeviews_controller.rb

INSERT INTO "reeviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 5], ["comment", "Sooper"], ["user_id", 1], ["movie_id", 1], ["created_at", "2016-12-07 18:15:17.484054"], ["updated_at", "2016-12-07 18:15:17.484054"]]
---
  def create
    @reeview = Reeview.new(reeview_params)
    @reeview.user_id = current_user.id
    @reeview.movie_id = @movie.id

    if @reeview.save

SELECT  "reeviews".* FROM "reeviews" WHERE "reeviews"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reeview
      @reeview = Reeview.find(params[:id])